results/redis4-kubernetes-single-node-01.txt
====== PING_INLINE ======
  100000 requests completed in 1.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.83% <= 1 milliseconds
99.71% <= 2 milliseconds
99.85% <= 3 milliseconds
99.88% <= 4 milliseconds
99.94% <= 5 milliseconds
99.95% <= 6 milliseconds
99.95% <= 7 milliseconds
99.96% <= 8 milliseconds
99.96% <= 16 milliseconds
100.00% <= 16 milliseconds
55,803.57 requests per second

====== PING_BULK ======
  100000 requests completed in 1.87 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.20% <= 1 milliseconds
99.87% <= 2 milliseconds
99.90% <= 3 milliseconds
99.92% <= 4 milliseconds
100.00% <= 4 milliseconds
53,475.94 requests per second

====== SET ======
  100000 requests completed in 1.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.47% <= 1 milliseconds
99.87% <= 2 milliseconds
99.91% <= 3 milliseconds
99.95% <= 4 milliseconds
99.99% <= 5 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
56,657.22 requests per second

====== GET ======
  100000 requests completed in 1.87 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.23% <= 1 milliseconds
99.60% <= 2 milliseconds
99.78% <= 3 milliseconds
99.86% <= 4 milliseconds
99.87% <= 5 milliseconds
99.89% <= 10 milliseconds
99.97% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 13 milliseconds
53,619.30 requests per second

====== INCR ======
  100000 requests completed in 1.80 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.85% <= 1 milliseconds
99.75% <= 2 milliseconds
99.84% <= 3 milliseconds
99.88% <= 4 milliseconds
99.97% <= 5 milliseconds
99.97% <= 10 milliseconds
100.00% <= 21 milliseconds
100.00% <= 21 milliseconds
55,555.56 requests per second

====== LPUSH ======
  100000 requests completed in 1.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.78% <= 1 milliseconds
99.81% <= 2 milliseconds
99.91% <= 3 milliseconds
99.92% <= 4 milliseconds
99.94% <= 5 milliseconds
99.96% <= 7 milliseconds
100.00% <= 8 milliseconds
59,844.41 requests per second

====== RPUSH ======
  100000 requests completed in 1.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.68% <= 1 milliseconds
99.86% <= 2 milliseconds
99.88% <= 3 milliseconds
99.95% <= 4 milliseconds
99.96% <= 5 milliseconds
99.98% <= 6 milliseconds
100.00% <= 6 milliseconds
59,808.61 requests per second

====== LPOP ======
  100000 requests completed in 1.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.89% <= 1 milliseconds
99.84% <= 2 milliseconds
99.94% <= 3 milliseconds
99.95% <= 4 milliseconds
100.00% <= 4 milliseconds
59,772.86 requests per second

====== RPOP ======
  100000 requests completed in 1.72 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.39% <= 1 milliseconds
99.75% <= 2 milliseconds
99.79% <= 3 milliseconds
99.83% <= 4 milliseconds
99.94% <= 5 milliseconds
99.96% <= 6 milliseconds
99.99% <= 11 milliseconds
100.00% <= 11 milliseconds
58,309.04 requests per second

====== SADD ======
  100000 requests completed in 1.77 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.00% <= 1 milliseconds
99.77% <= 2 milliseconds
99.83% <= 3 milliseconds
99.90% <= 4 milliseconds
99.91% <= 5 milliseconds
99.95% <= 8 milliseconds
99.95% <= 9 milliseconds
99.99% <= 10 milliseconds
100.00% <= 10 milliseconds
56,625.14 requests per second

====== HSET ======
  100000 requests completed in 1.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.61% <= 1 milliseconds
99.70% <= 2 milliseconds
99.77% <= 3 milliseconds
99.80% <= 4 milliseconds
99.85% <= 5 milliseconds
99.88% <= 6 milliseconds
99.91% <= 10 milliseconds
99.98% <= 11 milliseconds
100.00% <= 11 milliseconds
58,788.95 requests per second

====== SPOP ======
  100000 requests completed in 1.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.19% <= 1 milliseconds
99.82% <= 2 milliseconds
99.83% <= 3 milliseconds
99.87% <= 4 milliseconds
99.95% <= 5 milliseconds
99.97% <= 7 milliseconds
99.98% <= 8 milliseconds
100.00% <= 8 milliseconds
55,772.45 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 1.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.92% <= 1 milliseconds
99.91% <= 2 milliseconds
99.94% <= 3 milliseconds
99.95% <= 4 milliseconds
99.96% <= 5 milliseconds
99.97% <= 6 milliseconds
100.00% <= 6 milliseconds
59,417.71 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 2.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

75.35% <= 1 milliseconds
99.60% <= 2 milliseconds
99.79% <= 3 milliseconds
99.84% <= 4 milliseconds
99.89% <= 5 milliseconds
99.90% <= 9 milliseconds
99.93% <= 10 milliseconds
99.96% <= 11 milliseconds
100.00% <= 11 milliseconds
33,681.38 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.34 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

3.21% <= 1 milliseconds
98.82% <= 2 milliseconds
99.48% <= 3 milliseconds
99.70% <= 4 milliseconds
99.76% <= 5 milliseconds
99.87% <= 6 milliseconds
99.91% <= 8 milliseconds
99.95% <= 10 milliseconds
99.98% <= 12 milliseconds
100.00% <= 13 milliseconds
18,730.10 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 6.84 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
96.43% <= 2 milliseconds
98.86% <= 3 milliseconds
99.20% <= 4 milliseconds
99.43% <= 5 milliseconds
99.69% <= 6 milliseconds
99.83% <= 7 milliseconds
99.85% <= 8 milliseconds
99.89% <= 9 milliseconds
99.91% <= 11 milliseconds
99.92% <= 13 milliseconds
99.93% <= 14 milliseconds
99.94% <= 15 milliseconds
99.97% <= 18 milliseconds
100.00% <= 18 milliseconds
14,617.75 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 8.27 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
46.34% <= 2 milliseconds
98.55% <= 3 milliseconds
99.19% <= 4 milliseconds
99.47% <= 5 milliseconds
99.62% <= 6 milliseconds
99.82% <= 7 milliseconds
99.88% <= 8 milliseconds
99.88% <= 11 milliseconds
99.90% <= 12 milliseconds
99.95% <= 16 milliseconds
99.96% <= 17 milliseconds
100.00% <= 18 milliseconds
100.00% <= 18 milliseconds
12,096.29 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 1.32 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.00% <= 1 milliseconds
99.75% <= 2 milliseconds
99.82% <= 3 milliseconds
99.86% <= 4 milliseconds
99.95% <= 10 milliseconds
100.00% <= 10 milliseconds
75,757.57 requests per second